MNSWap/ErrorLog/AppLog-20160715.txt

7/15/2016 7:07:14 PM ==> <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://service.soap.mns.huawei.com" xmlns:types="http://service.soap.mns.huawei.com/encodedTypes" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><tns:subscribeMNSProduct><in0 href="#id1" /></tns:subscribeMNSProduct><q1:ProductSubscribeReq id="id1" xsi:type="q1:ProductSubscribeReq" xmlns:q1="http://request.service.soap.mns.huawei.com"><MSISDN xsi:type="xsd:string">2347032267237</MSISDN><channelID xsi:type="xsd:int">3</channelID><operDesc xsi:type="xsd:string">Islamic Lifestyle Mobile Magazine Featuring Daily Prayers, Hadith </operDesc><operTime xsi:type="xsd:string">20160715180712</operTime><productID xsi:type="xsd:string">23401220000010380</productID><transactionID xsi:type="xsd:string">7b0fb6e9-ecfa-44a8-a3a4-29129da78a61</transactionID></q1:ProductSubscribeReq></soap:Body></soap:Envelope>
7/15/2016 7:07:14 PM ==> <?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:subscribeMNSProductResponse soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://service.soap.mns.huawei.com"><subscribeMNSProductReturn href="#id0" /></ns1:subscribeMNSProductResponse><multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:SubscribeMNSProductRsp" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="http://response.service.soap.mns.huawei.com"><result href="#id1" /></multiRef><multiRef id="id1" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns3:Result" xmlns:ns3="http://pojo.service.soap.mns.huawei.com" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><resultCode xsi:type="soapenc:string">00000000</resultCode></multiRef></soapenv:Body></soapenv:Envelope>
7/15/2016 7:55:56 PM ==> <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://service.soap.mns.huawei.com" xmlns:types="http://service.soap.mns.huawei.com/encodedTypes" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><tns:subscribeMNSProduct><in0 href="#id1" /></tns:subscribeMNSProduct><q1:ProductSubscribeReq id="id1" xsi:type="q1:ProductSubscribeReq" xmlns:q1="http://request.service.soap.mns.huawei.com"><MSISDN xsi:type="xsd:string">2347032267237</MSISDN><channelID xsi:type="xsd:int">3</channelID><operDesc xsi:type="xsd:string">Daily real Crime stories from across the country - Powered By Crime Watch Newspaper. (N50/Weekly)</operDesc><operTime xsi:type="xsd:string">20160715185556</operTime><productID xsi:type="xsd:string">23401220000012061</productID><transactionID xsi:type="xsd:string">dab41aaa-d029-41ef-8838-1804ecb0b5f9</transactionID></q1:ProductSubscribeReq></soap:Body></soap:Envelope>
7/15/2016 7:55:57 PM ==> <?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:subscribeMNSProductResponse soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://service.soap.mns.huawei.com"><subscribeMNSProductReturn href="#id0" /></ns1:subscribeMNSProductResponse><multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:SubscribeMNSProductRsp" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="http://response.service.soap.mns.huawei.com"><result href="#id1" /></multiRef><multiRef id="id1" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns3:Result" xmlns:ns3="http://pojo.service.soap.mns.huawei.com" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><resultCode xsi:type="soapenc:string">00000000</resultCode></multiRef></soapenv:Body></soapenv:Envelope>
